; domain
(define (domain the_game)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :conditional-effects)

    (:types 
        pile card - object
    )

    (:predicates
        (ascending_pile ?p - pile)
        (descending_pile ?p - pile)
        (card_in_hand ?c - card)
        (top_pile_card ?p - pile ?c - card)
        (next_card_in_deck ?c1 - card ?c2 - card)  ; Simulates list order in drawing pile
        (top_deck_card ?c - card)
        (is_drawing)
        (is_bottom_card ?c - card)
        (deck_empty)
    )

    (:functions
        (value ?c - card)
        (n_card_in_hand) 
    )

    (:action play_card
        :parameters (?c - card ?p - pile ?c_top - card)
        :precondition (and
            (card_in_hand ?c) 
            (top_pile_card ?p ?c_top) 
            (not (is_drawing))
            (or 
                (and (ascending_pile ?p) (> (value ?c) (value ?c_top)))
                (and (descending_pile ?p) (< (value ?c) (value ?c_top)))
                (and (ascending_pile ?p) (= (value ?c) (- (value ?c_top) 5)))
                (and (descending_pile ?p) (= (value ?c) (+ (value ?c_top) 5)))
            )
        )
        :effect (and
            (not (card_in_hand ?c))
            (top_pile_card ?p ?c)
            (not (top_pile_card ?p ?c_top))
            (decrease (n_card_in_hand) 1)

        )
    )

    (:action draw_card
        :parameters (?c1 - card ?c2 - card)
        :precondition (and
            (top_deck_card ?c1)
            (next_card_in_deck ?c1 ?c2)
            (<= (n_card_in_hand) 6)
            (or 
                (is_drawing)
                (<= (n_card_in_hand) 5)
            )
        )
        :effect (and
            (not (top_deck_card ?c1))
            (top_deck_card ?c2)
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (is_drawing)
        )
    )
    
    (:action stop_drawing
        :parameters ()
        :precondition (and 
            (= (n_card_in_hand) 7)
            (is_drawing)
        )
        :effect (not (is_drawing))
    )

    (:action draw_final_card
        :parameters (?c1 - card)
        :precondition (and
            (top_deck_card ?c1)
            (is_bottom_card ?c1)
        )
        :effect (and
            (not (top_deck_card ?c1))
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (not (is_drawing))
            (deck_empty)
        )
    )

)

; problem
(define (problem medium)
    (:domain the_game)
    (:objects
        pile0 pile1 - pile
        c_min c_max c3 c15 c9 c10 c2 c4 c12 c17 c6 c8 c14 c16 c5 c7 c11 c19 c13 c18 - card
    )
    (:init
        (ascending_pile pile0)
        (descending_pile pile1)
        (top_pile_card pile0 c_min)
        (top_pile_card pile1 c_max)
        (top_deck_card c3)
        (next_card_in_deck c3 c15)
        (next_card_in_deck c15 c9)
        (next_card_in_deck c9 c10)
        (next_card_in_deck c10 c2)
        (next_card_in_deck c2 c4)
        (next_card_in_deck c4 c12)
        (next_card_in_deck c12 c17)
        (next_card_in_deck c17 c6)
        (next_card_in_deck c6 c8)
        (next_card_in_deck c8 c14)
        (next_card_in_deck c14 c16)
        (next_card_in_deck c16 c5)
        (next_card_in_deck c5 c7)
        (next_card_in_deck c7 c11)
        (next_card_in_deck c11 c19)
        (next_card_in_deck c19 c13)
        (next_card_in_deck c13 c18)
        (is_bottom_card c18)
        (= (n_card_in_hand) 0)
        (= (value c_min) 1)
        (= (value c_max) 20)
        (= (value c3) 3)
        (= (value c15) 15)
        (= (value c9) 9)
        (= (value c10) 10)
        (= (value c2) 2)
        (= (value c4) 4)
        (= (value c12) 12)
        (= (value c17) 17)
        (= (value c6) 6)
        (= (value c8) 8)
        (= (value c14) 14)
        (= (value c16) 16)
        (= (value c5) 5)
        (= (value c7) 7)
        (= (value c11) 11)
        (= (value c19) 19)
        (= (value c13) 13)
        (= (value c18) 18)
    )
    (:goal
        (and
            (deck_empty)
            (= (n_card_in_hand) 0)
        )
    )
)

; plan
1. (draw_card c3 c15)
   deleted: (top_deck_card c3)
   added: (top_deck_card c15) (card_in_hand c3) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
2. (draw_card c15 c9)
   deleted: (top_deck_card c15)
   added: (top_deck_card c9) (card_in_hand c15)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
3. (draw_card c9 c10)
   deleted: (top_deck_card c9)
   added: (top_deck_card c10) (card_in_hand c9)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
4. (draw_card c10 c2)
   deleted: (top_deck_card c10)
   added: (top_deck_card c2) (card_in_hand c10)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
5. (draw_card c2 c4)
   deleted: (top_deck_card c2)
   added: (top_deck_card c4) (card_in_hand c2)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
6. (draw_card c4 c12)
   deleted: (top_deck_card c4)
   added: (top_deck_card c12) (card_in_hand c4)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
7. (draw_card c12 c17)
   deleted: (top_deck_card c12)
   added: (top_deck_card c17) (card_in_hand c12)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
8. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
9. (play_card c3 pile1 c_max)
   deleted: (card_in_hand c3) (top_pile_card pile1 c_max)
   added: (top_pile_card pile1 c3)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
10. (play_card c2 pile1 c3)
   deleted: (card_in_hand c2) (top_pile_card pile1 c3)
   added: (top_pile_card pile1 c2)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
11. (play_card c9 pile0 c_min)
   deleted: (card_in_hand c9) (top_pile_card pile0 c_min)
   added: (top_pile_card pile0 c9)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
12. (play_card c4 pile0 c9)
   deleted: (card_in_hand c4) (top_pile_card pile0 c9)
   added: (top_pile_card pile0 c4)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
13. (play_card c12 pile0 c4)
   deleted: (card_in_hand c12) (top_pile_card pile0 c4)
   added: (top_pile_card pile0 c12)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 0 of 2
14. (play_card c15 pile0 c12)
   deleted: (card_in_hand c15) (top_pile_card pile0 c12)
   added: (top_pile_card pile0 c15)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 0 of 2
15. (play_card c10 pile0 c15)
   deleted: (card_in_hand c10) (top_pile_card pile0 c15)
   added: (top_pile_card pile0 c10)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 1 of 2
16. (draw_card c17 c6)
   deleted: (top_deck_card c17)
   added: (top_deck_card c6) (card_in_hand c17) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
17. (draw_card c6 c8)
   deleted: (top_deck_card c6)
   added: (top_deck_card c8) (card_in_hand c6)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
18. (draw_card c8 c14)
   deleted: (top_deck_card c8)
   added: (top_deck_card c14) (card_in_hand c8)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
19. (draw_card c14 c16)
   deleted: (top_deck_card c14)
   added: (top_deck_card c16) (card_in_hand c14)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
20. (draw_card c16 c5)
   deleted: (top_deck_card c16)
   added: (top_deck_card c5) (card_in_hand c16)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
21. (draw_card c5 c7)
   deleted: (top_deck_card c5)
   added: (top_deck_card c7) (card_in_hand c5)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
22. (draw_card c7 c11)
   deleted: (top_deck_card c7)
   added: (top_deck_card c11) (card_in_hand c7)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
23. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
24. (play_card c17 pile0 c10)
   deleted: (card_in_hand c17) (top_pile_card pile0 c10)
   added: (top_pile_card pile0 c17)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
25. (play_card c7 pile1 c2)
   deleted: (card_in_hand c7) (top_pile_card pile1 c2)
   added: (top_pile_card pile1 c7)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
26. (play_card c6 pile1 c7)
   deleted: (card_in_hand c6) (top_pile_card pile1 c7)
   added: (top_pile_card pile1 c6)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
27. (draw_card c11 c19)
   deleted: (top_deck_card c11)
   added: (top_deck_card c19) (card_in_hand c11) (is_drawing)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
28. (draw_card c19 c13)
   deleted: (top_deck_card c19)
   added: (top_deck_card c13) (card_in_hand c19)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
29. (draw_card c13 c18)
   deleted: (top_deck_card c13)
   added: (top_deck_card c18) (card_in_hand c13)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
30. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
31. (play_card c5 pile1 c6)
   deleted: (card_in_hand c5) (top_pile_card pile1 c6)
   added: (top_pile_card pile1 c5)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
32. (play_card c19 pile0 c17)
   deleted: (card_in_hand c19) (top_pile_card pile0 c17)
   added: (top_pile_card pile0 c19)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
33. (play_card c14 pile0 c19)
   deleted: (card_in_hand c14) (top_pile_card pile0 c19)
   added: (top_pile_card pile0 c14)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
34. (play_card c16 pile0 c14)
   deleted: (card_in_hand c16) (top_pile_card pile0 c14)
   added: (top_pile_card pile0 c16)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
35. (play_card c11 pile0 c16)
   deleted: (card_in_hand c11) (top_pile_card pile0 c16)
   added: (top_pile_card pile0 c11)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 0 of 2
36. (play_card c13 pile0 c11)
   deleted: (card_in_hand c13) (top_pile_card pile0 c11)
   added: (top_pile_card pile0 c13)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 0 of 2
37. (play_card c8 pile0 c13)
   deleted: (card_in_hand c8) (top_pile_card pile0 c13)
   added: (top_pile_card pile0 c8)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 1 of 2
38. (draw_final_card c18)
   deleted: (top_deck_card c18)
   added: (card_in_hand c18) (deck_empty)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 1 of 2
39. (play_card c18 pile0 c8)
   deleted: (card_in_hand c18) (top_pile_card pile0 c8)
   added: (top_pile_card pile0 c18)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 2 of 2
